
[1]M. B. Khan et al.IEEE Access. Image Processing and Analysis of Phase-Contrast Microscopic Images of Activated Sludge to Monitor the Wastewater Treatment Plants. 20186, PP.4, 1778-1791, DOI:https://doi.org/10.1109/ACCESS.2017.2780249. 
[2]B. Dai et al.IEEE Transactions on Systems, Man, and Cybernetics: Systems. Image Processing Unit for General-Purpose Representation and Association System for Recognizing Low-Resolution Digits With Visual Information Variability. 201848, PP.3, 317-328, DOI:https://doi.org/10.1109/TSMC.2016.2601902. 
[3]P. Morales-Álvarez et al.IEEE Transactions on Geoscience and Remote Sensing. Remote Sensing Image Classification With Large-Scale Gaussian Processes. 201856, PP.2, 1103-1114, DOI:https://doi.org/10.1109/TGRS.2017.2758922. 
[4]T. Y. Hsieh et al.IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems. Structural Variance-Based Error-Tolerability Test Method for Image Processing Applications. 201837, PP.2, 485-498, DOI:https://doi.org/10.1109/TCAD.2017.2705050. 
[5]P. Ghamisi et al.IEEE Geoscience and Remote Sensing Magazine. Advances in Hyperspectral Image and Signal Processing: A Comprehensive Overview of the State of the Art. 20175, PP.4, 37-78, DOI:https://doi.org/10.1109/MGRS.2017.2762087. 
[6]S. X. Zhang et al.IEEE Transactions on Geoscience and Remote Sensing. Characteristics Analysis and Image Processing for Full-Polarization Synthetic Aperture Radar Based on Electromagnetic Scattering From Flat Horizontal Perfect Electric Conducting Reflector. 201856, PP.1, 313-327, DOI:https://doi.org/10.1109/TGRS.2017.2747578. 
[6]S. X. Zhang et al.IEEE Transactions on Geoscience and Remote Sensing. Characteristics Analysis and Image Processing for Full-Polarization Synthetic Aperture Radar Based on Electromagnetic Scattering From Flat Horizontal Perfect Electric Conducting Reflector. 201856, PP.1, 313-327, DOI:https://doi.org/10.1109/TGRS.2017.2747578. IET Image Processing. Improved partial differential equation-based enhancement for underwater images using local #8211;global contrast operators and fuzzy homomorphic processes. 201711, PP.11, 1059-1067, DOI:https://doi.org/10.1049/iet-ipr.2017.0259. 
[7]E. Kalali et al.IEEE Transactions on Consumer Electronics. Low complexity 2D adaptive image processing algorithm and its hardware implementation. 201763, PP.3, DOI:https://doi.org/10.1109/TCE.2017.014996. 277-284, 
[8]C. Jiang et al.IEEE Access. Image Processing of Aluminum Alloy Weld Pool for Robotic VPPAW Based on Visual Sensing. 20175, PP.3, 21567-21573, DOI:https://doi.org/10.1109/ACCESS.2017.2761986. 
[9]G. Wu et al.IEEE Journal of Selected Topics in Signal Processing. Light Field Image Processing: An Overview. 201711, PP.7, 926-954, DOI:https://doi.org/10.1109/JSTSP.2017.2747126. 
[10]Z. Lv et al.IET Image Processing. Guest Editorial: Advances in Big Data Methods for Image Processing. 201711, PP.10, 803-804, DOI:https://doi.org/10.1049/iet-ipr.2017.0974. 
