
[1]B. Dietrich et al.IEEE Transactions on Computers. Time Series Characterization of Gaming Workload for Runtime Power Management. 201564, PP.1, 260-273, DOI:https://doi.org/10.1109/TC.2013.198. 
[2]G. C. Burdea et al.IEEE Transactions on Neural Systems and Rehabilitation Engineering. Robotics and Gaming to Improve Ankle Strength, Motor Control, and Function in Children With Cerebral Palsy #x2014;A Case Study Series. 201321, PP.2, 165-173, DOI:https://doi.org/10.1109/TNSRE.2012.2206055. 
[3]T. G. Papaioannou et al.IEEE Transactions on Smart Grid. Optimal Design of Serious Games for Consumer Engagement in the Smart Grid. 20189, PP.2, 1241-1249, DOI:https://doi.org/10.1109/TSG.2016.2582298. 
[4]J. Zhang et al.IEEE Access. Structural Attack on Reduced-Round Skipjack. 20186, PP.5, 3176-3183, DOI:https://doi.org/10.1109/ACCESS.2017.2787575. 
[5]T. S. Babu et al.IEEE Transactions on Sustainable Energy. Particle Swarm Optimization Based Solar PV Array Reconfiguration of the Maximum Power Extraction Under Partial Shading Conditions. 20189, PP.1, 74-85, DOI:https://doi.org/10.1109/TSTE.2017.2714905. 
[6]T. Wang et al.IEEE/ACM Transactions on Networking. An Efficient Online Algorithm for Dynamic SDN Controller Assignment in Data Center Networks. 201725, PP.5, 2788-2801, DOI:https://doi.org/10.1109/TNET.2017.2711641. 
[7]A. Khitun et al.IEEE Transactions on Nanotechnology. Two-Dimensional Oscillatory Neural Network Based on Room-Temperature Charge-Density-Wave Devices. 201716, PP.5, 860-867, DOI:https://doi.org/10.1109/TNANO.2017.2716845. 
[8]H. Li et al.IET Control Theory Applications. Stochastic set stabilisation of n-person random evolutionary Boolean games and its applications. 201711, PP.13, 2152-2160, DOI:https://doi.org/10.1049/iet-cta.2017.0047. 
[9]Y. Zheng et al.IEEE Transactions on Circuits and Systems for Video Technology. Online Cloud Transcoding and Distribution for Crowdsourced Live Game Video Streaming. 201727, PP.8, 1777-1789, DOI:https://doi.org/10.1109/TCSVT.2016.2556584. 
[9]Y. Zheng et al.IEEE Transactions on Circuits and Systems for Video Technology. Online Cloud Transcoding and Distribution for Crowdsourced Live Game Video Streaming. 201727, PP.8, 1777-1789, DOI:https://doi.org/10.1109/TCSVT.2016.2556584. IEEE Potentials. Superheroes and Scientists as Agents for Societal and Technological Advancement. 201736, PP.4, 24-29, DOI:https://doi.org/10.1109/MPOT.2017.2694298. 
