
[1]G. M. Tang et al.IEEE Transactions on Applied Superconductivity. Logic Design of a 16-bit Bit-Slice Arithmetic Logic Unit for 32-/64-bit RSFQ Microprocessors. 201828, PP.4, 1-5, DOI:https://doi.org/10.1109/TASC.2018.2799994. 
[2]A. Leva et al.IEEE Transactions on Control Systems Technology. Event-Based Power/Performance-Aware Thermal Management for High-Density Microprocessors. 201826, PP.2, 535-550, DOI:https://doi.org/10.1109/TCST.2017.2675841. 
[3]M. Fyrbiak et al.IEEE Transactions on Computers. Hybrid Obfuscation to Protect Against Disclosure Attacks on Embedded Microprocessors. 201867, PP.3, 307-321, DOI:https://doi.org/10.1109/TC.2017.2649520. 
[4]T. Adegbija et al.IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems. Microprocessor Optimizations for the Internet of Things: A Survey. 201837, PP.1, 7-20, DOI:https://doi.org/10.1109/TCAD.2017.2717782. 
[5]X. Li et al.IET Circuits, Devices Systems. Heuristic thermal sensor allocation methods for overheating detection of real microprocessors. 201711, PP.6, 559-567, DOI:https://doi.org/10.1049/iet-cds.2016.0529. 
[6]T. Kim et al.IEEE Transactions on Very Large Scale Integration (VLSI) Systems. Energy and Lifetime Optimizations for Dark Silicon Manycore Microprocessor Considering Both Hard and Soft Errors. 201725, PP.9, 2561-2574, DOI:https://doi.org/10.1109/TVLSI.2017.2707401. 
[7]F. M. Lins et al.IEEE Transactions on Nuclear Science. Register File Criticality and Compiler Optimization Effects on Embedded Microprocessor Reliability. 201764, PP.8, 2179-2187, DOI:https://doi.org/10.1109/TNS.2017.2705150. 
[8]A. Aloisio et al.IEEE Transactions on Nuclear Science. uSOP: A Microprocessor-Based Service-Oriented Platform for Control and Monitoring. 201764, PP.6, 1185-1190, DOI:https://doi.org/10.1109/TNS.2017.2707444. 
[9]M. Oma√a et al.IEEE Transactions on Computers. New Approaches for Power Binning of High Performance Microprocessors. 201766, PP.7, 1159-1171, DOI:https://doi.org/10.1109/TC.2017.2655060. 
