
M. B. Khan and H. Nisar and C. A. Ng. IEEE Access, 'Image Processing and Analysis of Phase-Contrast Microscopic Images of Activated Sludge to Monitor the Wastewater Treatment Plants', 2018vol.6, no.4, p.1778-1791, March
B. Dai and H. Li and L. Wei. IEEE Transactions on Systems, Man, and Cybernetics: Systems, 'Image Processing Unit for General-Purpose Representation and Association System for Recognizing Low-Resolution Digits With Visual Information Variability', 2018vol.48, no.3, p.317-328, March
P. Morales-Álvarez and A. Pérez-Suay and R. Molina and G. Camps-Valls. IEEE Transactions on Geoscience and Remote Sensing, 'Remote Sensing Image Classification With Large-Scale Gaussian Processes', 2018vol.56, no.2, p.1103-1114, Feb
T. Y. Hsieh and Y. H. Peng and K. C. Cheng. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 'Structural Variance-Based Error-Tolerability Test Method for Image Processing Applications', 2018vol.37, no.2, p.485-498, Feb
P. Ghamisi and N. Yokoya and J. Li and W. Liao and S. Liu and J. Plaza and B. Rasti and A. Plaza. IEEE Geoscience and Remote Sensing Magazine, 'Advances in Hyperspectral Image and Signal Processing: A Comprehensive Overview of the State of the Art', 2017vol.5, no.4, p.37-78, Dec
S. X. Zhang and M. D. Xing and K. Zhang. IEEE Transactions on Geoscience and Remote Sensing, 'Characteristics Analysis and Image Processing for Full-Polarization Synthetic Aperture Radar Based on Electromagnetic Scattering From Flat Horizontal Perfect Electric Conducting Reflector', 2018vol.56, no.1, p.313-327, Jan
U. A. Nnolim. IET Image Processing, 'Improved partial differential equation-based enhancement for underwater images using local #8211;global contrast operators and fuzzy homomorphic processes', 2017vol.11, no.11, p.1059-1067, Jan
E. Kalali and I. Hamzaoglu. IEEE Transactions on Consumer Electronics, 'Low complexity 2D adaptive image processing algorithm and its hardware implementation', 2017vol.63, no.3, Augustp.277-284, 
C. Jiang and F. Zhang and Z. Wang. IEEE Access, 'Image Processing of Aluminum Alloy Weld Pool for Robotic VPPAW Based on Visual Sensing', 2017vol.5, no.3, p.21567-21573, March
G. Wu and B. Masia and A. Jarabo and Y. Zhang and L. Wang and Q. Dai and T. Chai and Y. Liu. IEEE Journal of Selected Topics in Signal Processing, 'Light Field Image Processing: An Overview', 2017vol.11, no.7, p.926-954, Oct
Z. Lv and W. Li and Y. Yang. IET Image Processing, 'Guest Editorial: Advances in Big Data Methods for Image Processing', 2017vol.11, no.10, p.803-804, Jan
