
G. M. Tang and P. Y. Qu and X. C. Ye and D. R. Fan. IEEE Transactions on Applied Superconductivity, 'Logic Design of a 16-bit Bit-Slice Arithmetic Logic Unit for 32-/64-bit RSFQ Microprocessors', 2018vol.28, no.4, p.1-5, June
A. Leva and F. Terraneo and I. Giacomello and W. Fornaciari. IEEE Transactions on Control Systems Technology, 'Event-Based Power/Performance-Aware Thermal Management for High-Density Microprocessors', 2018vol.26, no.2, p.535-550, March
M. Fyrbiak and S. Rokicki and N. Bissantz and R. Tessier and C. Paar. IEEE Transactions on Computers, 'Hybrid Obfuscation to Protect Against Disclosure Attacks on Embedded Microprocessors', 2018vol.67, no.3, p.307-321, March
T. Adegbija and A. Rogacs and C. Patel and A. Gordon-Ross. IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, 'Microprocessor Optimizations for the Internet of Things: A Survey', 2018vol.37, no.1, p.7-20, Jan
X. Li and X. Wei and W. Zhou. IET Circuits, Devices Systems, 'Heuristic thermal sensor allocation methods for overheating detection of real microprocessors', 2017vol.11, no.6, p.559-567, Jan
T. Kim and Z. Sun and H. B. Chen and H. Wang and S. X. D. Tan. IEEE Transactions on Very Large Scale Integration (VLSI) Systems, 'Energy and Lifetime Optimizations for Dark Silicon Manycore Microprocessor Considering Both Hard and Soft Errors', 2017vol.25, no.9, p.2561-2574, Sept
F. M. Lins and L. A. Tambara and F. L. Kastensmidt and P. Rech. IEEE Transactions on Nuclear Science, 'Register File Criticality and Compiler Optimization Effects on Embedded Microprocessor Reliability', 2017vol.64, no.8, p.2179-2187, Aug
A. Aloisio and F. Ameli and A. Anastasio and P. Branchini and F. Di Capua and R. Giordano and V. Izzo and G. Tortone. IEEE Transactions on Nuclear Science, 'uSOP: A Microprocessor-Based Service-Oriented Platform for Control and Monitoring', 2017vol.64, no.6, p.1185-1190, June
M. Oma√a and M. Padovani and K. Veliu and C. Metra and J. Alt and R. Galivanche. IEEE Transactions on Computers, 'New Approaches for Power Binning of High Performance Microprocessors', 2017vol.66, no.7, p.1159-1171, July
